{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"outputs": {"output": {"name": "output"}}}}, "modelTopology": {"node": [{"name": "ConstantFolding/split_26-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "1x1/Identity_tf_0_reshape_start_bcaea5ca", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "1x1/bias_tf_0_0b2a5857", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv11/bias_tf_0_8e59fa8a", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv10/bias_tf_0_753efad9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "Conv9/bias_tf_0_5684f504", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "Conv8/bias_tf_0_bdd7c1b0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv7/bias_tf_0_a829f391", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv6/bias_tf_0_6b926a0f", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Conv5/bias_tf_0_da56f685", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Conv4/bias_tf_0_ad6c0315", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv3/bias_tf_0_3c66f1a8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2/bias_tf_0_e8d9da0d", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Conv1/bias_tf_0_b474dbd5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv0/bias_tf_0_bd499fa7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "40"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Transpose55/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "split", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "BN0/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "BN0/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_24", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "split_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "BN1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "BN2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN2/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "BN3/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "BN4/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN4/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "BN5/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN5/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "BN6/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN6/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN7/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN7/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN8/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN8/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Where", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "BN9/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "BN9/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "split_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "BN10/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN10/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "split_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "BN11/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BN11/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "convolution", "op": "Conv2D", "input": ["input", "split"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add", "op": "Add", "input": ["Conv0/bias_tf_0_bd499fa7", "convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_2", "op": "Transpose", "input": ["Add", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu12", "op": "Relu", "input": ["transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN0/mul_1", "op": "Mul", "input": ["BN0/mul", "Relu12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN0/add_1", "op": "AddV2", "input": ["BN0/mul_1", "BN0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_4", "op": "Transpose", "input": ["BN0/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_1", "op": "Conv2D", "input": ["transpose_4", "split_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Add_1", "op": "Add", "input": ["Conv1/bias_tf_0_b474dbd5", "convolution_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_5", "op": "Transpose", "input": ["Add_1", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu11", "op": "Relu", "input": ["transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN1/mul_1", "op": "Mul", "input": ["BN1/mul", "Relu11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN1/add_1", "op": "AddV2", "input": ["BN1/mul_1", "BN1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_6", "op": "Transpose", "input": ["BN1/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool", "op": "MaxPool", "input": ["transpose_6"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "convolution_2", "op": "Conv2D", "input": ["MaxPool", "split_4"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Add_2", "op": "Add", "input": ["Conv2/bias_tf_0_e8d9da0d", "convolution_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_10", "op": "Transpose", "input": ["Add_2", "Transpose55/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu10", "op": "Relu", "input": ["transpose_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN2/mul_1", "op": "Mul", "input": ["BN2/mul", "Relu10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN2/add_1", "op": "AddV2", "input": ["BN2/mul_1", "BN2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_12", "op": "Transpose", "input": ["BN2/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_3", "op": "Conv2D", "input": ["transpose_12", "split_6"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add_3", "op": "Add", "input": ["Conv3/bias_tf_0_3c66f1a8", "convolution_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_13", "op": "Transpose", "input": ["Add_3", "Transpose55/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu9", "op": "Relu", "input": ["transpose_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN3/mul_1", "op": "Mul", "input": ["BN3/mul", "Relu9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN3/add_1", "op": "AddV2", "input": ["BN3/mul_1", "BN3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_14", "op": "Transpose", "input": ["BN3/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool_1", "op": "MaxPool", "input": ["transpose_14"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "convolution_4", "op": "Conv2D", "input": ["MaxPool_1", "split_8"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add_4", "op": "Add", "input": ["Conv4/bias_tf_0_ad6c0315", "convolution_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_18", "op": "Transpose", "input": ["Add_4", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu8", "op": "Relu", "input": ["transpose_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN4/mul_1", "op": "Mul", "input": ["BN4/mul", "Relu8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN4/add_1", "op": "AddV2", "input": ["BN4/mul_1", "BN4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_20", "op": "Transpose", "input": ["BN4/add_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_5", "op": "Conv2D", "input": ["transpose_20", "split_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Add_5", "op": "Add", "input": ["Conv5/bias_tf_0_da56f685", "convolution_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_21", "op": "Transpose", "input": ["Add_5", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu7", "op": "Relu", "input": ["transpose_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN5/mul_1", "op": "Mul", "input": ["BN5/mul", "Relu7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN5/add_1", "op": "AddV2", "input": ["BN5/mul_1", "BN5/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_22", "op": "Transpose", "input": ["BN5/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool_2", "op": "MaxPool", "input": ["transpose_22"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_6", "op": "Conv2D", "input": ["MaxPool_2", "split_12"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Add_6", "op": "Add", "input": ["Conv6/bias_tf_0_6b926a0f", "convolution_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_26", "op": "Transpose", "input": ["Add_6", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu6", "op": "Relu", "input": ["transpose_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN6/mul_1", "op": "Mul", "input": ["BN6/mul", "Relu6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN6/add_1", "op": "AddV2", "input": ["BN6/mul_1", "BN6/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_28", "op": "Transpose", "input": ["BN6/add_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_7", "op": "Conv2D", "input": ["transpose_28", "split_14"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add_7", "op": "Add", "input": ["Conv7/bias_tf_0_a829f391", "convolution_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_29", "op": "Transpose", "input": ["Add_7", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu5", "op": "Relu", "input": ["transpose_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN7/mul_1", "op": "Mul", "input": ["BN7/mul", "Relu5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN7/add_1", "op": "AddV2", "input": ["BN7/mul_1", "BN7/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_30", "op": "Transpose", "input": ["BN7/add_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "MaxPool_3", "op": "MaxPool", "input": ["transpose_30"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "convolution_8", "op": "Conv2D", "input": ["MaxPool_3", "split_16"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Add_8", "op": "Add", "input": ["Conv8/bias_tf_0_bdd7c1b0", "convolution_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_34", "op": "Transpose", "input": ["Add_8", "Transpose55/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu4", "op": "Relu", "input": ["transpose_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN8/mul_1", "op": "Mul", "input": ["BN8/mul", "Relu4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN8/add_1", "op": "AddV2", "input": ["BN8/mul_1", "BN8/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_36", "op": "Transpose", "input": ["BN8/add_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_9", "op": "Conv2D", "input": ["transpose_36", "split_18"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Add_9", "op": "Add", "input": ["Conv9/bias_tf_0_5684f504", "convolution_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_37", "op": "Transpose", "input": ["Add_9", "Transpose55/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu3", "op": "Relu", "input": ["transpose_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN9/mul_1", "op": "Mul", "input": ["BN9/mul", "Relu3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN9/add_1", "op": "AddV2", "input": ["BN9/mul_1", "BN9/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_38", "op": "Transpose", "input": ["BN9/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool_4", "op": "MaxPool", "input": ["transpose_38"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "convolution_10", "op": "Conv2D", "input": ["MaxPool_4", "split_20"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Add_10", "op": "Add", "input": ["Conv10/bias_tf_0_753efad9", "convolution_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_42", "op": "Transpose", "input": ["Add_10", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu2", "op": "Relu", "input": ["transpose_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN10/mul_1", "op": "Mul", "input": ["BN10/mul", "Relu2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN10/add_1", "op": "AddV2", "input": ["BN10/mul_1", "BN10/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_44", "op": "Transpose", "input": ["BN10/add_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_11", "op": "Conv2D", "input": ["transpose_44", "split_22"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Add_11", "op": "Add", "input": ["Conv11/bias_tf_0_8e59fa8a", "convolution_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_45", "op": "Transpose", "input": ["Add_11", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu1", "op": "Relu", "input": ["transpose_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN11/mul_1", "op": "Mul", "input": ["BN11/mul", "Relu1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BN11/add_1", "op": "AddV2", "input": ["BN11/mul_1", "BN11/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_46", "op": "Transpose", "input": ["BN11/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool_5", "op": "MaxPool", "input": ["transpose_46"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "convolution_12", "op": "Conv2D", "input": ["MaxPool_5", "split_24"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "Add_12", "op": "Add", "input": ["1x1/bias_tf_0_0b2a5857", "convolution_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_50", "op": "Transpose", "input": ["Add_12", "Transpose55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["transpose_50"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Mean_1", "op": "Mean", "input": ["Relu", "ConstantFolding/split_26-folded-1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "1x1/Identity0_transpose", "op": "Transpose", "input": ["Mean_1", "transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Shape_6", "op": "Shape", "input": ["1x1/Identity0_transpose"], "attr": {"out_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "GatherV2", "op": "GatherV2", "input": ["Shape_6", "Squeeze", "GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "SparseToDense", "op": "SparseToDense", "input": ["Where", "Cast", "GatherV2", "zeros"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "add_13", "op": "AddV2", "input": ["1x1/Identity_tf_0_reshape_start_bcaea5ca", "SparseToDense"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "1x1/Identity0_reshape", "op": "Reshape", "input": ["1x1/Identity0_transpose", "add_13"], "attr": {"Tshape": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "output", "op": "Softmax", "input": ["1x1/Identity0_reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ConstantFolding/split_26-folded-1", "shape": [2], "dtype": "int32"}, {"name": "1x1/Identity_tf_0_reshape_start_bcaea5ca", "shape": [2], "dtype": "int32"}, {"name": "1x1/bias_tf_0_0b2a5857", "shape": [256], "dtype": "float32"}, {"name": "Conv11/bias_tf_0_8e59fa8a", "shape": [128], "dtype": "float32"}, {"name": "Conv10/bias_tf_0_753efad9", "shape": [128], "dtype": "float32"}, {"name": "Conv9/bias_tf_0_5684f504", "shape": [128], "dtype": "float32"}, {"name": "Conv8/bias_tf_0_bdd7c1b0", "shape": [128], "dtype": "float32"}, {"name": "Conv7/bias_tf_0_a829f391", "shape": [64], "dtype": "float32"}, {"name": "Conv6/bias_tf_0_6b926a0f", "shape": [64], "dtype": "float32"}, {"name": "Conv5/bias_tf_0_da56f685", "shape": [64], "dtype": "float32"}, {"name": "Conv4/bias_tf_0_ad6c0315", "shape": [64], "dtype": "float32"}, {"name": "Conv3/bias_tf_0_3c66f1a8", "shape": [32], "dtype": "float32"}, {"name": "Conv2/bias_tf_0_e8d9da0d", "shape": [32], "dtype": "float32"}, {"name": "Conv1/bias_tf_0_b474dbd5", "shape": [16], "dtype": "float32"}, {"name": "Conv0/bias_tf_0_bd499fa7", "shape": [16], "dtype": "float32"}, {"name": "Transpose55/perm", "shape": [4], "dtype": "int32"}, {"name": "split", "shape": [1, 5, 1, 16], "dtype": "float32"}, {"name": "transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "BN0/mul", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "BN0/sub", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "split_24", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "split_2", "shape": [1, 3, 16, 16], "dtype": "float32"}, {"name": "BN1/mul", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "BN1/sub", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "split_4", "shape": [1, 5, 16, 32], "dtype": "float32"}, {"name": "BN2/mul", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "BN2/sub", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "split_6", "shape": [1, 3, 32, 32], "dtype": "float32"}, {"name": "BN3/mul", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "BN3/sub", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "split_8", "shape": [1, 5, 32, 64], "dtype": "float32"}, {"name": "BN4/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "BN4/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "split_10", "shape": [1, 3, 64, 64], "dtype": "float32"}, {"name": "BN5/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "BN5/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "split_12", "shape": [1, 5, 64, 64], "dtype": "float32"}, {"name": "BN6/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "BN6/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "split_14", "shape": [1, 3, 64, 64], "dtype": "float32"}, {"name": "BN7/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "BN7/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "split_16", "shape": [1, 5, 64, 128], "dtype": "float32"}, {"name": "BN8/mul", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "BN8/sub", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "split_18", "shape": [1, 3, 128, 128], "dtype": "float32"}, {"name": "Where", "shape": [1, 1], "dtype": "int32"}, {"name": "Squeeze", "shape": [1], "dtype": "int32"}, {"name": "BN9/mul", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "BN9/sub", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "split_20", "shape": [1, 5, 128, 128], "dtype": "float32"}, {"name": "GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "BN10/mul", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "BN10/sub", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "Cast", "shape": [1], "dtype": "int32"}, {"name": "split_22", "shape": [1, 3, 128, 128], "dtype": "float32"}, {"name": "zeros", "shape": [], "dtype": "int32"}, {"name": "BN11/mul", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "BN11/sub", "shape": [1, 128, 1, 1], "dtype": "float32"}]}]}